# ForgeTypeId Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ForgeTypeId Properties
ForgeTypeId Class See Also
---
The ForgeTypeId type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| TypeId | The schema identifier. |

# See Also
ForgeTypeId Class
Autodesk.Revit.DB Namespace